JonS9999/CarClock/CarClock-ESP8266/src/main.cpp
//----------------------------------------------------------------------------
//
//  main.cpp
//
//      Version 1.6
//
//----------------------------------------------------------------------------
//
//  History :
//
//      Ver 1.6 : 2026/03/14
//          - Added inline routines GetCommandDelay() and SetCommandDelay()
//            to MyDisplay_LCD2004.h to allow the user to change the default
//            delay() value when sending commands to the LCD.
//          - Got rid of Print_Delay() (in MyDisplay_LCD2004.*) since we
//            now can use the new Get/SetCommandDelay() routines.
//
//      Ver 1.5 : 2026/03/12
//          - Modified cb_WiFi_NoUsableNetwork() callback to display the
//            number of open networks we found.
//
//      Ver 1.4 : 2026/03/11
//          - Changed display code so that cMyDisplay_LCD2004 is a derived
//            class of cMyDisplay.
//
//      Ver 1.3 : 2026/03/01
//          - Added code to search open WiFi networks.
//
//      Ver 1.2 : 2026/02/20
//          - Added SerialCommand library to be able to drive the clock
//            via the serial (USB) port -- Not doing anything with this yet.
//          - Changed some of the messages that are displayed on the LCD.
//          - Added an ASCII "screen" to MyDisplay_LCD2004 so we keep a copy
//            of what is displayed on the LCD.  This way we can test our code
//            without needing an actual LCD connected to the ESP8266.
//            Note that the ASCII "screen" can be displayed using normal
//            ASCII characters, or it can be displayed using VT100 graphics
//            characters -- the is controlled by the m_VT100_Emulation
//            attribute in the MyDisplay_LCD2004 object.
//
//      Ver 1.1 : 2026/02/15
//          - Added MyDisplay + MyDisplay_LCD support.
//          - Added MyRTC support for I2C RTC.
//          - Added OTA (Over The Air) programming support.
//          - Minor changes like renaming "secrets.cpp" to "Secrets.cpp",
//            displaying our IP address when we connect to a WiFi network,
//            etc...
//          - Still needs a code cleanup and some refactoring (but I wanted
//            to get this code checked in as a snapshot of a working clock).
//
//      Ver 1.0 : 2026/02/01
//          - Initial version.
//          - Simply clock with WiFi + NTP support.
//
//----------------------------------------------------------------------------
//
//      Hardware
//
//        - Wemos D1 Mini (https://www.wemos.cc/en/latest/d1/d1_mini.html)
//
//        - LCD2004 20x4 Hitachi-type LCD display.
//
//        - I2C devices on our I2C bus :
//              0x27 : LCD Backpack.
//              0x57 : AT24Cxxx EEPROM series (on RTC board).
//              0x68 : DS3231 RTC.
//
//----------------------------------------------------------------------------
//
//      Future :
//
//        - Weather current + forecast information (e.g., pull down weather
//          info when we connect to a WiFi network).
//
//        - MQTT client to display messages.  This could be useful if I use
//          the clock as a stationary clock in my house -- for example, it
//          could display 3D printer status messages (M117) when I'm running
//          my 3D printer.  Or when someone comes to the door and rings the
//          doorbell (i.e, integrate with my home automation setup).
//
//        - Display OTA updating progress on the LCD so we can see what is
//          happening.
//
//        - Maybe a speaker or piezo electric element so it can alert when
//          the weather turns bad or someone rings the doorbell or when we
//          successfully connect to a WiFi network and get the time or...
//
//        - Possibly configure networks (that we search for) at runtime
//          instead of at compile time (e.g., get rid of Secrets.cpp).
//          Maybe use a web interface (WebIotConf perhaps?).
//
//        - Push button for control, for example :
//              - Cycling through screens.
//              - Display weather current conditions + forecast.
//              - WiFi information (IP address, subnet mask, etc).
//              - Force rebooting (if button is held for a long time).
//              - ...many more things...
//
//----------------------------------------------------------------------------
//
//      Notes for me :
//
//          - Code cleanup.
//
//          - Remove unnecessary MyPrintf() lines.
//
//          - Refine/Cleanup the m_Display.DisplayMessage3() call.  Try to
//            make this into a more generic routine.
//
//          - Use callbacks (cb_*) for various things.
//
//          - Register c_WiFi object with other objects (e.g., pass a
//            pointer or reference to the object into the setup() routine
//            of objects that need access to WiFi stuff).  This makes things
//            less tied-together than they are now (e.g., I could remove the
//            MyWiFi.* stuff, and everything else would still work).
//
//          - Be more creative with the colon?  For example:
//                  - o : (Big dot) Normal operation / On WiFi.
//                  - ! : Normal operation / Not on WiFi.
//                  - * : (Snowflake) Weather warning.
//
//          - Implement the things listed in the section above.
//
//      Stuff dealing with the 3D printed case :
//          - Include case STLs in the github repo.
//          - Modify case to have a cable-hole in the back part of the case.
//          - Maybe put in one or more holes for push buttons.
//
//----------------------------------------------------------------------------


//
//  System include files :
//
#include <Arduino.h>
#include <stdarg.h>         // Required for variable arguments
#include <ESP8266WiFi.h>    // Wifi for ESP8266.
#include <ezTime.h>         // Timezone stuff.      *** Note that the ezTime library generates some warnings ***
#include <SerialCommand.h>  // For reading commands from the serial/USB port.


//
//  Local include files :
//
#include "Common.h"
#include "MyDisplay.h"              // Display driver (base class).
#include "MyRTC.h"                  // Real Time Clock (RTC) stuff.
#include "MyWiFi.h"                 // WiFi/Network stuff.
#include "MyWiFi_OTA.h"             // WiFi OTA (Over The Air) programming support.
#include "Secrets.h"                // Where our personal (secret) stuff is defined.


//
//  Things we may want to implement some day :
//
#if 0
#include "MyDisplay_TFT"            // Do we want to support a TFT display?
#include "MyWeather.h"              // Stuff to pull current and future weather information.
#include "MyWebManager.h"           // Maybe someday implement this...
#include "MyWiFi_MQTT"              // MQTT client support.
#endif


//
//  Single instances of some objects :
//
//SimpleTimer     g_Timer;        // Timer for sending messages to the MQTT broker.
cMyRTC          g_RTC;          // One instance of the Real Time Clock (RTC) object.
cMyWiFi         g_WiFi;         // One instance of the WiFi object.
SerialCommand   g_SerialCmd;    // Serial port command line interface.


//
//  WiFi networks information :
//
tSystemConfig    config;


//
//  Used to determine timezone and thus calculate the correct local time :
//
Timezone myTZ;


//----------------------------------------------------------------------------
//
//  cb_TimeSyncEvent () -- Callback which is called by ezTime library.
//
//      *** NOT CURRENTLY USED ***
//
//----------------------------------------------------------------------------

void cb_TimeSyncEvent ()
{
    //
    //  Local variables :
    //
    timeStatus_t status = timeStatus();     // timeStatus() returns 0, 1, or 2 (timeNotSet, timeNeedsSync, timeSet)


