JonS9999/CarClock/CarClock-ESP8266/src/main.cpp
    switch ( status )
    {
        case timeSet :          // Value: 2
            MyPrintf ( "[cb_TimeSyncEvent]  NTP Sync Successful!\n" );
            break;

        case timeNeedsSync :    // Value: 1
            MyPrintf ( "[cb_TimeSyncEvent]  NTP Sync failed (using old/expired time).\n" );
            break;

        case timeNotSet :       // Value: 0
            MyPrintf ( "[cb_TimeSyncEvent]  NTP Sync failed (time never set).\n" );
            break;

        default:
            MyPrintf ( "[cb_TimeSyncEvent]  NTP Sync status: %d.\n", status );
            break;
    } // switch
}


//----------------------------------------------------------------------------
//
//  cb_WiFi_Connecting () -- WiFi callback which is called when the WiFi
//                           module attempts to connect to an access point.
//
//----------------------------------------------------------------------------

void cb_WiFi_Connecting (   const char* SSID,
                            const char* passwd )
{
    //
    //  Local variables :
    //
    char    buf[80];                                // Temporary text buffer.


    MyPrintf ( "[cb_WiFi_Connecting]  ------------------------------------------\n" );
    MyPrintf ( "[cb_WiFi_Connecting]  Called : AP = [%s] / Type = [%s].\n",
        SSID,
        ( ( (passwd == NULL) || (strlen(passwd) == 0) ) ? "OPEN" : "SECURE" ) );


    //
    //  Create the string to display :
    //
    //                          "--------------------"
    //                          "Trying open WiFi :",
    //                          "Trying secure WiFi :",
    snprintf ( buf, sizeof(buf), "Trying %s WiFi :",
        ( ( (passwd == NULL) || (strlen(passwd) == 0) ) ? "open" : "secure" ) );


    //                           "--------------------"
    g_Display->DisplayMessage3 ( buf,                        // Row 0 (see above).
                                 "",                         // Row 1.
                                 SSID,                       // Row 2 (SSID).
                                 false );                    // Do not force SSID to the bottom row.
}


//----------------------------------------------------------------------------
//
//  cb_WiFi_ConnectingAttempt () -- Callback routine which is
//              called when we are trying to connect to a WiFi network.
//              We are passed in the maximum number of attempts that will
//              be made and the number of attempts made so far.
//
//----------------------------------------------------------------------------

void cb_WiFi_ConnectingAttempt (    const uint8_t   numAttemptsSoFar,
                                    const uint8_t   maxAttempts )
{
    MyPrintf ( "[cb_WiFi_ConnectingAttempt]  Called : Attempt # %u of %u.\n",
                numAttemptsSoFar,
                maxAttempts );


    //
    //  Do we have a display callback that should be called ?
    //
    if ( g_Display != NULL )
    {
        MyPrintf ( "[cb_WiFi_ConnectingAttempt]  Calling g_Display->cb_WiFi_ConnectingAttempt()...\n" );
        g_Display->cb_WiFi_ConnectingAttempt ( numAttemptsSoFar, maxAttempts );
    }
}


//----------------------------------------------------------------------------
//
//  cb_WiFi_NoUsableNetwork () -- WiFi callback which is called when
//              the WiFi module is not able to connect to any network.
//
//      Note that we only display something the first time we are called.
//      This is so that once we're running and searching for networks, when
//      we don't find one, we just return as quickly as possible (to get
//      back to displaying the time on our display).
//
//----------------------------------------------------------------------------

void cb_WiFi_NoUsableNetwork (  const uint8_t   numSecureNetworks,
                                const uint8_t   numOpenNetworks )
{
    //
    //  Always display the following :
    //
    MyPrintf ( "[cb_WiFi_NoUsableNetwork]  ------------------------------------------\n" );
    MyPrintf ( "[cb_WiFi_NoUsableNetwork]  Num secure = %u / Num open = %u.\n",
                numSecureNetworks,
                numOpenNetworks );


    //
    //  Do we have a display callback that should be called ?
    //
    if ( g_Display != NULL )
    {
        MyPrintf ( "[cb_WiFi_NoUsableNetwork]  Calling g_Display->cb_WiFi_NoUsableNetwork()...\n" );
        g_Display->cb_WiFi_NoUsableNetwork ( numSecureNetworks, numOpenNetworks );
    }
}


//----------------------------------------------------------------------------
//
//  cb_WiFi_ScanningForNetworks () -- WiFi callback which is called
//              when the WiFi module is about to scan for networks.
//
//----------------------------------------------------------------------------

void cb_WiFi_ScanningForNetworks ( void )
{
    MyPrintf ( "[cb_WiFi_ScanningForNetworks]  ------------------------------------------\n" );
    MyPrintf ( "[cb_WiFi_ScanningForNetworks]  Called.\n" );

    //                           "--------------------"
    g_Display->DisplayMessage3 ( "Scanning for WiFi",
                                 "networks.",
                                 "Please wait..." );

    delay ( 2000 );
}


//----------------------------------------------------------------------------
//
//  cb_WiFi_SearchingForOpenNetwork () -- WiFi callback which is called
//              when the WiFi module searches for an open network.
//
//----------------------------------------------------------------------------

void cb_WiFi_SearchingForOpenNetwork ( void )
{
    MyPrintf ( "[cb_WiFi_SearchingForOpen]  ------------------------------------------\n" );
    MyPrintf ( "[cb_WiFi_SearchingForOpen]  Called.\n" );

    //                           "--------------------"
    g_Display->DisplayMessage3 ( "Searching for an",
                                 "open network.",
                                 "Please wait..." );

    delay ( 2000 );
}


//----------------------------------------------------------------------------
//
//  cb_WiFi_SearchingForPreferredNetwork () -- WiFi callback which is called
//              when the WiFi module searches for a preferred network.
//
//----------------------------------------------------------------------------

void cb_WiFi_SearchingForPreferredNetwork ( void )
{
    MyPrintf ( "[cb_WiFi_SearchingForPreferred]  ------------------------------------------\n" );
    MyPrintf ( "[cb_WiFi_SearchingForPreferred]  Called.\n" );

    //                           "--------------------"
    g_Display->DisplayMessage3 ( "Searching for a",
                                 "preferred network.",
                                 "Please wait..." );

