JonS9999/CarClock/CarClock-ESP8266/src/main.cpp
    delay ( 2000 );
}


//----------------------------------------------------------------------------
//
//  setup ()
//
//----------------------------------------------------------------------------

void setup ( void )
{
    //
    //  Local variables :
    //
    //char    buf[30];


    Serial.begin ( 115200 );
    delay ( 2000 );

    Serial.println ( "\n\n\n" );
    MyPrintf ( "=== %s ===\n", __FILE__ );
    MyPrintf ( "Built %s at %s.\n", __DATE__, __TIME__ );


    //
    //  Status (heartbeat) LED :
    //
    pinMode ( LED_BUILTIN, OUTPUT );

#if 1   // DEBUG HACK
    //
    //  Let's blink the built-in LED a few times to show that
    //  we are alive :
    //
    for ( int i = 0 ; i < 3 ; i++ )
    {
        digitalWrite ( LED_BUILTIN, HIGH );
        delay ( 50 );
        digitalWrite ( LED_BUILTIN, LOW );
        delay ( 50 );
    }
#endif


    //
    //  Initialize our display object :
    //
    g_Display->setup ();
    g_Display->SetObjectSerialCmd ( &g_SerialCmd );
    g_Display->DisplaySplashScreen ();


    //
    //  Initialize our RTC (Real Time Clock) object :
    //
    g_RTC.setup ();


    //
    //  Were we successful in initializing the RTC ?
    //
    if ( g_RTC.IsInitialized() == true )
    {
        //
        //  Set our system time from the time stored in the RTC :
        //
        g_RTC.SetSystemTimeFromRTC ();
    }
    else
    {
        MyPrintf ( "[setup]  *** Unable to initialize the RTC -- Ignoring future RTC operations ***\n" );

        //                          "--------------------"
        g_Display->DisplayMessage3 ( g_WiFi.MyHostname(),
                                    "",
                                    "* Cannot find RTC *",
                                    false );

        delay ( 2000 );
    }


    //
    //  Initialize our system configuration :
    //
    memset ( &config, 0, sizeof(config) );


    //
    //  Initialize our WiFi object :
    //
    g_WiFi.setup ();
    g_WiFi.SetCallback_Connecting                   ( cb_WiFi_Connecting );
    g_WiFi.SetCallback_ConnectingAttempt            ( cb_WiFi_ConnectingAttempt );
    g_WiFi.SetCallback_NoUsableNetwork              ( cb_WiFi_NoUsableNetwork );
    g_WiFi.SetCallback_ScanningForNetworks          ( cb_WiFi_ScanningForNetworks );
    //g_WiFi.SetCallback_SearchingForOpenNetwork      ( cb_WiFi_SearchingForOpenNetwork );
    //g_WiFi.SetCallback_SearchingForPreferredNetwork ( cb_WiFi_SearchingForPreferredNetwork );


    //
    //  Load our personal info (WiFI SSIDs and passwords) from Secrets.cpp
    //  and also setup our default timezone :
    //
    SecretsSetup ();

    MyPrintf ( "[setup]  Defaulting to timezone '%s'.\n", MY_TIMEZONE );
    myTZ.setPosix ( MY_TIMEZONE );              // Defined in Secrets.cpp


    //
    //  Clear the display :
    //
    g_Display->ClearScreen ();


#if 0   // RTC stuff -- DEBUG HACK
    g_RTC.Debug_Test_001 ();
#endif


    MyPrintf ( "Running...\n" );
    MyPrintf ( "-----------------------------\n" );
}

//----------------------------------------------------------------------------

void loop ( void )
{
    //
    //  Local variables :
    //
    bool            success;
    bool            forceDisplayUpdate  = false;
    bool            displayWiFiInfo     = false;            // Set to 'true' if we connect to a new WiFi network.
    int             h;
    int             m;
    int             curMin              = minute();
    int             curTzHour           = 0;
    int             curTzMin            = 0;
    int             curTzSec            = 0;
    uint32_t        curMillis           = millis();
    time_t          newNtpUpdateTime;
    time_t          oldNtpUpdateTime;
    static int      s_NumGetTimeRetries = 0;
    static int      s_NumWiFiRetries    = 0;
    static int      s_LastMin           = -1;
    static uint32_t s_LastMillis        = 0;
    static uint32_t s_NextWiFiTry       = 0;
    static uint32_t s_NextTimeFetch     = 0;
    static uint32_t s_NextRtcSetTime    = 0;
    static String   s_LastWiFiIPAddr    = "";
    static String   s_LastWiFiSSID      = "";


    //
    //  Is this the first time we're being called ?
    //
    if ( g_FirstTime == true )
    {
        MyPrintf ( "[Loop]  =========================================\n" );
        MyPrintf ( "[Loop]  Main loop is running.\n" );
    }


    //
    //  Handle events and such :
    //
    events();                       // ezTime.cpp -- ezTime background tasks
    g_Display->handle ();           // Display driver.
    g_RTC.handle ();                // RTC (Real Time Clock) driver.
    g_WiFi.handle ();               // WiFi driver.


    //---------------------------------------------------------------
    //
    //  Are we supposed to try to connect to a WiFi network ?
    //
    //---------------------------------------------------------------

    if ( (WiFi.status() != WL_CONNECTED) && (curMillis > s_NextWiFiTry) )
    {
        MyPrintf ( "[Loop]  Trying to connect to a WiFi network...\n" );

        //
        //  Use our own semi-fancy WiFi manager :
        //
        success = g_WiFi.Connect ();

        g_Display->ClearScreen ();

        //
        //  If successful, then force us to get the time now :
        //
        if ( success == true )
        {
            //
            //  Determine if we've connected to a new WiFi network :
            //
            if ( (s_LastWiFiIPAddr != WiFi.localIP().toString() ) ||
                 (s_LastWiFiSSID   != WiFi.SSID()) )
            {
                s_LastWiFiIPAddr = WiFi.localIP().toString();
                s_LastWiFiSSID   = WiFi.SSID();

                MyPrintf ( "[Loop]  Connected to a new WiFi network [%s] (%s).\n",
                    s_LastWiFiSSID.c_str(),
                    s_LastWiFiIPAddr.c_str() );

                //
                //  Set the flag to show the extended WiFi info :
                //
                displayWiFiInfo = true;
            }

            MyPrintf ( "[Loop]  Connected.  We need to get the time...\n" );

            //
            //  Reset our count of the number of WiFi retries :
            //
            s_NumWiFiRetries = 0;

            //
            //  Should we show the extended WiFi information ?
            //
            if ( displayWiFiInfo == true )
            {
                //
                //  Display some WiFi information on the LCD display :
                //
                //                           "--------------------"
                g_Display->DisplayMessage3 ( "Connected to WiFi :",
                                             WiFi.SSID().c_str(),
                                             WiFi.localIP().toString().c_str() );

                delay ( 4000 );
            }

            //
            //  We can set s_NextWiFiTry to 0 so if our current WiFi
            //  connection drops, we immediately try to reconnect :
            //
            s_NextWiFiTry = 0;

            //
            //  Force us to fetch the time right away :
            //
            s_NextTimeFetch = 0;
        }
        else
        {
            MyPrintf ( "[Loop]  WiFi connection failed.\n" );

            //
            //  Clear the "last WiFi connectd to" info :
            //
            s_LastWiFiIPAddr = "";
            s_LastWiFiSSID   = "";

            //
            //  Increment the number of WiFi connect retries :
            //
            s_NumWiFiRetries++;

            //
            //  Try to connect again based on how many time we've
            //  tried to connect :
            //
            if ( s_NumWiFiRetries < 10 )
            {
                s_NextWiFiTry = ( curMillis + MINS_TO_MSECS(1) );       // Try in 1 minute.
            }
            else
            {
                s_NextWiFiTry = ( curMillis + MINS_TO_MSECS(30) );      // Try in 30 minutes.
            }
        }

        //
        //  Make sure we update the LCD :
        //
        forceDisplayUpdate = true;
    }


    //---------------------------------------------------------------
    //
    //  Is it time to get the time ?
    //
    //---------------------------------------------------------------

    if ( (WiFi.status() == WL_CONNECTED) && (curMillis > s_NextTimeFetch) )
    {
        MyPrintf ( "[Loop]  Trying to get the time...\n" );

        //                           "--------------------"
        g_Display->DisplayMessage3 ( "Connected to WiFi :",
                                     WiFi.SSID().c_str(),
                                     "Getting the time..." );


        // waitForSync();                              // ezTime.cpp
//        waitForSync ( 15 );     // ezTime.cpp : Increase timeout to 15 seconds for cellular
        waitForSync ( 8 );     // ezTime.cpp : Increase timeout to 8 seconds for cellular

        if ( timeStatus() != timeSet )
        {
            MyPrintf ( "[Loop]  NTP Sync Failed - trying using updateNTP()...\n" );
            oldNtpUpdateTime = lastNtpUpdateTime();
            MyPrintf ( "[Loop]  Last NTP date was at %d.\n", (int)oldNtpUpdateTime );

            updateNTP();

            newNtpUpdateTime = lastNtpUpdateTime();
            MyPrintf ( "[Loop]  New  NTP date was at %d.\n", (int)newNtpUpdateTime );

            if ( oldNtpUpdateTime == newNtpUpdateTime )
            {
                MyPrintf ( "[Loop]  Oops, it looks like our NTP request failed.\n" );
                s_NumGetTimeRetries++;
                MyPrintf ( "[Loop]  Number of NTP failed tries = %d.\n", s_NumGetTimeRetries );
            }
            else
            {
                MyPrintf ( "[Loop]  Hey, it looks like our NTP request succeeded!\n" );
                s_NumGetTimeRetries = 0;

                //
                //  Wait a few seconds before we try to set the time in the
                //  RTC (we need to give NTP time to set our system clock) :
                //
                s_NextRtcSetTime = ( curMillis + 5000 );
            }
        }
        else
        {
            MyPrintf ( "[Loop]  waitForSync() time request succeeded.\n" );
            s_NumGetTimeRetries = 0;

            //
            //  Wait a few seconds before we try to set the time in the
            //  RTC (we need to give NTP time to set our system clock) :
            //
            s_NextRtcSetTime = ( curMillis + 5000 );
        }

