JonS9999/CarClock/CarClock-ESP8266/src/main.cpp
        MyPrintf ( "[Loop]  Time synced: [%s]\n", myTZ.dateTime().c_str() );

        MyPrintf ( "[Loop]  Continuing...\n" );

        g_Display->ClearScreen ();

        //
        //  Try to get the time again based on how many time we've
        //  tried to get the time :
        //
        //  Get the time in 10 seconds if we failed to get the time
        //  1 to 9 times :
        //
        if ( (s_NumGetTimeRetries > 0) && (s_NumGetTimeRetries < 10) )
        {
            MyPrintf ( "[Loop]  Will try to get the time again in %d seconds.\n", 30 );
            s_NextTimeFetch = ( curMillis + SECS_TO_MSECS(30) );      // Try to get the time every 30 seconds.
        }
        else
        {
            MyPrintf ( "[Loop]  Will try to get the time again in %d minutes.\n", 65 );
            s_NextTimeFetch = ( curMillis + MINS_TO_MSECS(65) );      // Try to get the time every 65 minutes.
        }

        //
        //  Make sure we update the LCD :
        //
        forceDisplayUpdate = true;
    }


    //---------------------------------------------------------------
    //
    //  We only redraw the digits if the minute changes to save
    //  I2C bandwidth :
    //
    //---------------------------------------------------------------

    curTzHour   = myTZ.hour();
    curTzMin    = myTZ.minute();
    curTzSec    = myTZ.second();

    if ( (forceDisplayUpdate == true) || (curMin != s_LastMin) )
    {
        s_LastMin = curMin;

        //
        //  Do some sanity checking on the time fields -- we need to
        //  do this if we don't have an RTC connected to us :
        //
        curTzHour = ( curTzHour % 24 );         // 0..23.
        curTzMin  = ( curTzMin  % 60 );         // 0..59.
        curTzSec  = ( curTzSec  % 60 );         // 0..59

        h = curTzHour;
        m = curTzMin;

        MyPrintf ( "[Loop]  Time = %s.\n", myTZ.dateTime("D, M j Y  g:i a").c_str() );

        // 12-hour format conversion
        if ( h > 12 ) h -= 12;
        if ( h == 0 ) h = 12;

        //
        //  Now display the time on our display :
        //
        g_Display->DisplayTime ( h, m, curTzSec );

    } // if


    //---------------------------------------------------------------
    //
    //  Should we update the time in the RTC ?
    //
    //---------------------------------------------------------------

    if ( g_RTC.IsInitialized() == true )
    {
        if ( (s_NextRtcSetTime != 0) && (curMillis >= s_NextRtcSetTime) )
        {
            MyPrintf ( "[Loop]  Time to set the time in the RTC...\n" );

            //
            //  Try to update the time in the RTC.  Note that if our system
            //  time is not valid (e.g., we haven't yet been able to get the
            //  current time from an NTP server), the SetRTCFromSystemTime()
            //  call will return 'false'.  In that event, we will try to set
            //  the RTC time again in 5 seconds :
            //
            if ( g_RTC.SetRTCFromSystemTime() == false )
            {
                MyPrintf ( "[Loop]  +++ Warning -- Unable to set RTC time / Will try again later +++\n" );

                //
                //  Try to set the time again in 5 seconds :
                //
                s_NextRtcSetTime = ( curMillis + 5000 );
            }
            else
            {
                MyPrintf ( "[Loop]  We have successfully set the RTC time.\n" );

                //
                //  Set this to 0 to indicate the RTC has been updated :
                //
                s_NextRtcSetTime = 0;
            }
        }
    }


    //---------------------------------------------------------------
    //
    //  Toggle the built-in LED every second :
    //
    //---------------------------------------------------------------

    if ( (curMillis - s_LastMillis) >= 1000 )
    {
        digitalWrite ( LED_BUILTIN, ( ( ( (curMillis / 1000) % 2)  == 0 ) ? HIGH : LOW ) );

        s_LastMillis = curMillis;
    }


    //---------------------------------------------------------------
    //
    //  Clear our global "first time" flag since we've run this loop once :
    //
    //---------------------------------------------------------------

    g_FirstTime = false;
}


//----------------------------------------------------------------------------
//
//  end of  main.cpp
//
//----------------------------------------------------------------------------
